In [1]:
import numpy as np
import pandas as pd

In [2]:
def nba_copy():
    return pd.read_csv("../data/nba.csv").copy()

In [3]:
nba = pd.read_csv("../data/nba.csv")
nba.sample(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
262,Mike Conley,Memphis Grizzlies,11.0,PG,28.0,6-1,175.0,Ohio State,9588426.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
40,Kristaps Porzingis,New York Knicks,6.0,PF,20.0,7-3,240.0,NaN,4131720.0
242,Trevor Ariza,Houston Rockets,1.0,SF,30.0,6-8,215.0,UCLA,8193030.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0

In [4]:
nba.isna().any()

Name        True
Team        True
Number      True
Position    True
Age         True
Height      True
Weight      True
College     True
Salary      True
dtype: bool

In [5]:
nba["Name"].isna().values.sum()

1

In [6]:
nba.isna().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [7]:
nba.isnull().sum().sum()

104

In [8]:
nba.isna().values.sum()

104

In [9]:
nba.isnull().values.sum()

104

In [10]:
nba_db = nba_copy()

In [11]:
nba_db.isna().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [12]:
nba_db.isna().sum().sum()

104

In [13]:
nba_db.dropna(how='all')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [14]:
nba_db.dropna(subset=["College"])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
...,...,...,...,...,...,...,...,...,...
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [15]:
nba_db['College'].dtype

dtype('O')

In [16]:
total_nan_values = nba_db.isna().sum().sum()
if total_nan_values > 0:
    nba_db.dropna(subset=["Age"], inplace=True)

In [17]:
nba_db['Age'].dtype

dtype('float64')

In [18]:
nba_db['Age'].hasnans

False

In [19]:
nba_db['Age'] = nba_db['Age'].astype(int)

In [20]:
nba_db['Age']

0      25
1      25
2      27
3      22
4      29
       ..
452    20
453    26
454    24
455    26
456    26
Name: Age, Length: 457, dtype: int64

In [21]:
nba_db['College']

0                  Texas
1              Marquette
2      Boston University
3          Georgia State
4                    NaN
             ...
452             Kentucky
453               Butler
454                  NaN
455                  NaN
456               Kansas
Name: College, Length: 457, dtype: object

#### get the indexes for all rows containing NaN values in a specific column

In [22]:
nba_db.index[pd.isnull(nba_db['Name'])]

Int64Index([], dtype='int64')

In [23]:
nba_db['College'].isna()

0      False
1      False
2      False
3      False
4       True
       ...
452    False
453    False
454     True
455     True
456    False
Name: College, Length: 457, dtype: bool

In [24]:
nba_db['Salary'].isna().sum()

11

In [25]:
# nba_db['Salary'] = nba_db['Salary'].fillna(nba_db['Salary'].mean())

In [31]:
nba_db['Salary'].fillna(nba_db['Salary'].mean())

0      7.730337e+06
1      6.796117e+06
2      4.842684e+06
3      1.148640e+06
4      5.000000e+06
           ...
452    2.239800e+06
453    2.433333e+06
454    9.000000e+05
455    2.900000e+06
456    9.472760e+05
Name: Salary, Length: 457, dtype: float64

In [38]:
nba_db['Salary'] = nba_db['Salary'].fillna(nba_db['Salary'].mean()).astype(int)

In [39]:
nba_db['Salary']

0      7730337
1      6796117
2      4842684
3      1148640
4      5000000
        ...
452    2239800
453    2433333
454     900000
455    2900000
456     947276
Name: Salary, Length: 457, dtype: int64